# Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка
#######################################################################################
x = int(input('Enter first coordinate: '))
y = int(input('Enter second coordinate: '))
if x != 0 and y != 0:
    if x > 0 and y > 0:
        print(1)
    elif x < 0 and y > 0:
        print(2)
    elif x < 0 and y < 0:
        print(3)
    else:
        print(4)
else:
    print('It\'s a wrong coordinates')
