# Напишите программу для. проверки истинности утверждения
#  ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат
##########################################################
print('---------------------------------------------')
print('Исходы при всех возможных значениях предикат:')
print('---------------------------------------------')

for x in [True, False]: 
    for y in [True, False]:
        for z in [True, False]:
            res = not(x or y or z) == (not x and not y and not z)
            print(f'X = {x}, Y =  {y}, Z = {z}, В результате получаем: {res}.') 